{
    "title": "Self-Love and Depression: My Experience",
    "content": "Kids are beautiful. They are nature’s manifestation of love and innocence. They represent the most pure and vulnerable form of human life. That curiosity, happiness, energy, and excitement of witnessing this world that they find themselves in. Kids learn a lot while they are kids and repeat those things in some or the other form when they become adults.  My childhood was ruined by a number of things. I found myself in a situation where I had to prove myself to be worthy of any appreciation, love and attention. That I had to dance for everyone whom I encounter along the way and help them realise that I can be a worthwhile person to be around. It made me hate myself and believe that I was worthless as a person, especially when I saw someone else being treated with love and care. And that has stayed with me till this day. This self-hatred made me a very insecure person and there were quite interesting side-effects  I became emotionally numb, I was unable to form any healthy friendships (until very recently), I surrounded myself with people who only took advantage of me and treated me terribly. I was always unhappy. I felt like my existence didn’t amount to anything. I used to tolerate disrespectful behaviour and seek out and remain in touch with such people. Then came a point when I just shut down, my life stopped and I remained in misery and a toxic environment for too long. Needless to say, I have lived a very unsatisfying life.   Your body speaks to you. It talks to you, it tries to tell you things and you have to listen to it, there is no choice here. When you are excited, the body gives you chills. When you are hungry, it makes all sorts of noise paired with a hollow feeling in the stomach. When you are sad, it tears up your eyes. When you are very happy, it tears up your eyes with a wide smile on your face.  But when you are depressed, you stop listening to your body but the body is adamant. It speaks louder and louder and louder until you start paying attention again. When you are depressed, the body starts to get sad, weak, and unhealthy. Physical health deteriorates. That’s the body telling you, begging you to pay attention to yourself, that something is wrong. Something is wrong. And the body starts decaying more and more rapidly until you listen to it and focus on that something, that is wrong.  For me, a lot was wrong but most importantly, it was the people I surrounded myself with, that was wrong. I hung out with people whom I considered friends but who didn’t have my best interests in mind, nor did they put in the effort. I would also seek out and force my way into people’s lives who were rather not interested in being a part of my life. I rarely took any care of myself.  It takes a little time but the more wrongs you right, the happier and healthier the body becomes and so does the mind. Depression is a state of mind when someone hates themselves to the core and this will eventually kill them, both mentally and physically and no-one deserves to die like this, slowly, painfully, everyday bit-by-bit. It takes a lot of courage to break this cycle of living in such a toxic way because it is all you have known or seen your entire life. There is an inherent belief that there is love around you but not for you. It seems only valid to assume that you are not worthy of it and that people will never accept you because no matter how hard you try, you just can’t grab hold of it. Not even a grain of it. And, I don’t just mean romantic love, I refer to all forms of it. I have always craved for the most basic one – to be treated like a human whose emotions mattered 🥲  There is a lot of talk about self-love and self-validation on the Internet but for someone who lives with such self-hatred, it is nearly impossible to have any positive feelings about themselves, let alone practise “Self-Love”. When someone hates themselves to the core, there is no love within them because they don’t know how to love. At least for me, I grew up in a chaotic environment and experienced more bullish treatment than moments of love and care. I don’t know how love feels or looks like. It is an entity that I know exists somewhere out there but it is out of my reach.   A hungry man becomes desperate for food. He has been starving and running empty for days. The only choice he has is to search for thrown away food in the trash cans, dust bin, and dumpsters. He has to live on rotten food NOT because it is better than nothing but because it will at least fill up his stomach for today. For someone, who is starved of the most basic human requirements – the need to feel that their life amounts to something and that they are worthy of love – I was starved ever since I was a little kid. And I was in dumpsters looking for even a grain of attention and validation – to soothe my otherwise soul, to calm it down, maybe even for just a second. It is a difficult place to be in. I did find some things in the dumpster but it only made me sick. I ended up finding myself with the wrong set of people who just took advantage of me, made me terrible about myself, invalidated my emotions and feelings. They added more fuel to my already existing self-hatred.   Deep down somewhere I knew all of this was bad for me, that all of this was wrong for me to accept and tolerate. But I would much rather sleep with a full stomach than an empty one because I always believed that things were never going to get better and that this is all the world has to offer me. Soon, I was down. I was acting out. I wasn’t doing well and this isn’t surprising, after all, rotten food isn’t good for you.   I got lucky though. I can surely say that today I am doing really well only because a few random strangers took time and helped me out. I am sincerely indebted to those random acts of kindness and the people who showed me what “healthy” love and care looks like. Since then, I stopped visiting the dumpsters because I finally tasted real things and they were much much better and healthier. The people we surround ourselves with, can make you or break you and I surrounded myself with the wrong set of people for way too long.   In the end, it is my responsibility to lead a healthy and happy life. I cannot blame my misery on people. Self-Love is important – we must all take care of ourselves, eat well, dress well, exercise, consume healthy content off the internet or books or people. But once in a while, we all fall down. It is the nature of life and during those times, it is important to be surrounded by people who know how to get you up and running and not push you the other way around.  I am sure that depression feels different to different people but I believe that the cause of the depression is the same. We hate ourselves to depression. We lose the light of our life. It is difficult to get yourself out of the rabbit-hole alone but it is not impossible to get out and lead a healthy and happy life. We must seek help and that too from the right set of people. People with whom you feel safe, who know when to pamper and when to show tough-love and who know how to love. In the end, I think a severe lack of love leads to depression.",
    "date": "26/02/2023",
    "tags": "depression,self-love,family",
    "htmlID": "POST_1"
}